#+Property: header-args  :cache yes
#+PROPERTY: header-args+  :exports code
#+PROPERTY: header-args+  :noweb strip-export
#+TITLE: Names, Functions, and Types
#+options: num:nil

#+begin_src sml
  fun gcd(m, n) =
      if m=0 then n
      else gcd(n mod m, m);

  fun length [] = 0
    | length (x::xs) = 1 + length xs;
#+end_src

#+RESULTS:
: val gcd = fn : int * int -> int

